<?php

function art_banner() {
    GLOBAL $SORDVERSION, $SORD_DELINACT, $SORD_DAYLENGTH, $SORD_BANKINT, $SORD_FFIGHT, $SORD_PFIGHT, $SORD_HOST, $SORD_ADMIN;
    $rundays = control_getruntime();
    $thismsg  = "\033[32m                           Saga Of The Red Dragon\n";
    $thismsg .= "\033[32m			       {$SORD_HOST}\n\n";
    $thismsg .= "\033[32m                    Compiled June 25, 2009: Version \033[1;37m{$SORDVERSION}\n";
    $thismsg .= "\033[22;32m                        (c) pre-2009 by Someone Else\n\n";
    $thismsg .= "\033[32m                           \033[1;37mREGISTERED TO \033[0m\033[1;34m{$SORD_ADMIN}\033[0m\n\n";
    $thismsg .= "\033[32m             The current game has been running for \033[1m{$rundays}\033[22m game days.\n";
    $thismsg .= "\033[32m            Players are deleted after \033[1m{$SORD_DELINACT}\033[22m real days of inactivity.\n";
    $thismsg .= "\033[32m               Players are enjoying \033[1m{$SORD_FFIGHT}\033[22m forest fights per day.\n";
    $thismsg .= "\033[32m               Players are enjoying \033[1m{$SORD_PFIGHT}\033[22m player fights per day.\n";
    $thismsg .= "\033[32m            Players are enjoying \033[1m{$SORD_BANKINT}%\033[22m interest at the bank per day.\n";
    $thismsg .= "\033[32m                   The current game day is \033[1m{$SORD_DAYLENGTH}\033[22m real hours long.\n\n";
    $thismsg .= "\033[32m                         (\033[1mE\033[22m)nter the realm of the Dragon\n";
    $thismsg .= "\033[32m                         (\033[1mL\033[22m)ist Warriors\n";
    $thismsg .= "\033[32m                         (\033[1mQ\033[22m)uit the game server\n\n";
    $thismsg .= "\033[32m                         Your choice, warrior? [\033[1mE\033[22m]: \033[0m";
    return $thismsg;
}

function art_line() {
    return "\033[32m-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n";
}
    
function art_blueline() {
    return "\033[34m-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-\n";
}

function art_header() {
    $thismsg .= "\033[31;41mллллллллллл\033[30;41mп\033[37;40m \033[30;41mмм\033[31;41mллллл\033[30;41mмлп\033[31;41mлллллллллллллллллллллллллллллллллллллллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[31;41m              \033[37;40m         \033[31;40mппл\033[31;41m          \033[31;40mллллллллллллллллллллллллллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[30;41m               \033[31;40mм\033[37;40m        \033[31;40mм\033[31;41m        \033[37;40m \033[31;41m  \033[31;40mллллллллл\033[30;41mлпп\033[31;40mл\033[30;41mмпм\033[31;40mл\033[30;41mлпп\033[31;40mл\033[30;41mмпм\033[31;40mлллл\033[30;41mмпм\033[31;40mлл\033[30;40mл\033[30;41mпп\033[31;40mллллллл\033[0m\n";
    $thismsg .= "\033[30;41m              \033[31;40mп    мм\033[31;41m          \033[31;40mп  \033[31;41m  \033[31;40mллллллллл\033[30;41mппл\033[31;41mл\033[30;41mлпл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mлпл\033[31;40mлллл\033[30;40mл\033[31;40mл\033[30;40mл\033[31;40mлл\033[30;40mл\033[30;41mп\033[31;40mлллллллл\033[0m\n";
    $thismsg .= "\033[30;41m             \033[37;40m  \033[31;40mААм\033[31;41m       \033[31;40mппп\033[37;40m      \033[31;41m           \033[30;41mммл\033[31;41m \033[30;41mл\033[31;41m \033[30;41mл\033[31;41m \033[30;41mллл\033[31;41m \033[30;41mл\033[31;41m \033[30;41mл\033[31;41m     \033[30;40mл\033[31;41m   \033[30;40mл\033[31;41m         \033[0m\n";
    $thismsg .= "\033[31;41m            \033[37;40m  \033[31;40mАА\033[31;41m    \033[31;40mп\033[37;40m             \033[31;41m      \033[31;40mллллллллллллллллллллллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[30;40m   \033[31;40mпп\033[31;41m      \033[37;40m  \033[31;40mАА\033[31;41m  \033[31;40mп\033[37;40m                \033[31;41m       \033[31;40mлллм\033[30;40mл\033[31;40mмл\033[30;40mл\033[31;40mл\033[30;40mл\033[31;40mл\033[30;40mл\033[30;41mпп\033[31;40mлллл\033[30;41mлпм\033[31;40mл\033[30;41mлпп\033[31;40mл\033[30;41mлпм\033[31;40mллллллллл\033[0m\n";
    $thismsg .= "\033[37;40m       \033[31;40mп\033[31;41m  \033[37;40m  \033[31;40mАААп\033[37;40m                  \033[31;41m       \033[31;40mлллл\033[30;40mл\033[31;40mлл\033[30;40mл\033[30;41mп\033[30;40mл\033[31;40mл\033[30;40mл\033[30;41mп\033[31;40mллллл\033[30;41mлмл\033[31;40mл\033[30;41mлп\033[31;40mлл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mллллллллл\033[0m\n";
    $thismsg .= "\033[37;40m            \033[31;40mААА\033[37;40m            \033[31;40mА\033[37;40m      \033[31;41m           \033[30;40mл\033[31;41m  \033[30;40mл\033[31;41m \033[30;40mл\033[31;40mл\033[30;40mллл\033[31;41m    \033[30;41mлпм\033[31;41m \033[30;41mллл\033[31;41m \033[30;41mллл\033[31;41m         \033[0m\n";
    $thismsg .= "\033[37;40m            \033[31;40mААА\033[37;40m         \033[31;40mАААБАА    \033[31;41m      \033[31;40mллллллллллллллллллллллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[31;40mАА\033[37;40m         \033[31;40mББА\033[37;40m       \033[31;40mАААБББББАА  \033[31;41m        \033[31;40mлллл\033[30;41mлпм\033[31;40mл\033[30;41mлпм\033[31;40mл\033[30;41mмпм\033[31;40mл\033[30;41mлпп\033[31;40mл\033[30;41mмпм\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mм\033[31;40mллллллллллл\033[0m\n";
    $thismsg .= "\033[31;40mББАА\033[37;40m       \033[31;40mБББ    АААББББББББББА \033[31;41m        \033[31;40mлллл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mлпл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mл\033[31;40mл\033[30;41mлмл\033[31;40mлллллллл\033[1m\033[31;41mммм\033[0m\n";
    $thismsg .= "\033[1m\033[31;41m \033[0m\033[31;40mБББА\033[37;40m      \033[31;40mБББ   БББББББББББББББА\033[31;41m            \033[30;41mллл\033[31;41m \033[30;41mлпм\033[31;41m \033[30;41mл\033[31;41m \033[30;41mл\033[31;41m \033[30;41mллл\033[31;41m  \033[30;41mл\033[31;41m  \033[30;41mл\033[31;41m \033[30;41mл\033[31;41m   \033[1m\033[31;41mммлллллл\033[0m\n";
    $thismsg .= "\033[1m\033[31;41m   \033[0m\033[31;40mББ\033[37;40m     \033[31;40mББББ    БББ\033[31;41m   \033[31;40mББББББББ\033[31;41m           \033[31;40mллллллллллллллллллллллллл\033[1m\033[31;41mм\033[1m\033[31;40mлллллллллп\033[0m\n";
    $thismsg .= "\033[1m\033[31;41m    \033[0m\033[37;40m      \033[31;40mБББББ    \033[31;41m       \033[31;40mББББББ\033[31;41m                                   \033[1m\033[31;41mлллллл\033[1m\033[31;40mппп\033[0m\033[30;41mллл\033[0m\n";
    $thismsg .= "\033[30;41mАААА\033[37;40m      \033[31;40mБББББ\033[37;40m     \033[30;41mААААААА\033[31;40mББББ\033[30;41mААААААААААААААААААААААААААААААААААА\033[1m\033[31;40mпп\033[0m\033[30;41mллллллллллл\033[0m\n";
    $thismsg .= "\033[30;40m  \033[31;40mп\033[30;41mА\033[37;40m      \033[31;40mАААБББ    \033[30;41mАААААААА\033[31;40mББ\033[30;41mААААААААААААААААААААААААААААААллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[37;40m           \033[31;40mАААААА    \033[30;41mББББББББББББББББББББББББББББББББлллллллллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[30;41mВ\033[37;40m          \033[31;40mАААААА\033[37;40m     \033[30;41mВВВВВВВВВВВВВВВВВВВВВВВВВВВлллллллллллллллллллллллллллллл\033[0m\n";
    $thismsg .= "\033[37;40m                                                                      \033[30;41mллл\033[0m\n";
    return $thismsg . "\n";
}

function art_abdul() {
    $thismsg .= "\033[1;33mмммм\033[0;33mмм\033[1mмм\033[0;33mм\033[1mммм\033[0;33mм\033[1mмм\033[0;33mм\033[1mм\033[0;33mмм\033[1mм\033[0;33mммммммммммммммммммммммммммммммммммммммммммммммммммммм\033[1;30mм\033[C\033[0;33mмммм\n";
    $thismsg .= "\033[A\033[79Cм\033[1;43mлВ\033[0;33mлллпллп\033[32mм\033[33mп\033[32mм\033[Cў\033[33mллллллллл\033[1;30;43mА\033[C\033[0;33mл\033[1;43mБА\033[CА\033[C\033[37;40mSaga\033[Cof\033[Cthe\033[CRed\033[CDragon\033[C-\033[C\033[33mAbduls\033[CArmour    \033[C\033[0;33mп\n";
    $thismsg .= "\033[1;43mл\033[0;33mллп\033[32mм\033[1;42mБ\033[0;32mм\033[Cп\033[1mп\033[2C\033[0;33mппп\033[30;43mБА\033[33;40mлллллл\033[1;30;43mА\033[2C\033[0;33mпл\033[Cпппппппппппппппппппппппппппппппппппппппппппппппппп\n";
    $thismsg .= "\033[A\033[79C\033[1;30;43mА\033[33mл\033[0;33mлллм\033[32mп\033[33mмлп\033[37mм\033[1;47mА\033[0mлп\033[1;30;47mАА\033[40mмм\033[0;33mп\033[30;43mБА\033[33;40mллл\033[1;30;43mБ\033[C\033[0;33mм\033[1;30mп\033[4C\033[0;33mBehind\033[Cthe\033[Cdesk\033[Cof\033[Cthe\033[Carmour\033[Cshop\033[Cis\033[Can\n";
    $thismsg .= "\033[1;43mл\033[0;33mлллл\033[30;43mАБ\033[C\033[37;40mп\033[1;47mБА\033[C\033[0mллл\033[1;30;47mАБВ\033[C\033[0;30;43mБА\033[33;40mлл\033[1;30;43mВ\033[C\033[40mпм\033[4C\033[0;33mamazingly\033[Cattractive\033[Clooking\033[Cfemale - she seems\n";
    $thismsg .= "\033[1;43mл\033[0;33mлл\033[30;43mАБ\033[33;40mп\033[1;37mм\033[47mБА\033[0mммммм\033[1;30mммп\033[47mБВ\033[C\033[0;30;43mБА\033[33;40mл\033[1;30;43mл\033[2C\033[0;32mмў\033[3C\033[33mbusy, doing her mails but she\033[Casks\033[C\"\033[1mHow\n";
    $thismsg .= "\033[43mл\033[0;33mпл\033[30;43mАБ\033[C\033[1;37;47mВ\033[40mоо\033[47mА\033[C\033[30mА\033[CБ\033[40mм\033[47mВ\033[40mпм\033[47mл\033[C\033[0;30;43mБА\033[33;40mп\033[32mмВ\033[6C\033[1;33mmay\033[CI\033[Cbe\033[Cof\033[Cservice?\033[0;33m\"\n";
    $thismsg .= "\033[1mм\033[0;33mп\033[Cмм\033[C\033[1;37mп\033[47mВ\033[0mм\033[1;47mБ\033[0mм\033[1;30;47mА\033[0mм\033[1;30mппм\033[47mБВ\033[C\033[0;30;43mБ\033[33;40mп\033[32mм\033[1;42mА\033[0;32mм\n";
    $thismsg .= "\033[1;33;43mл\033[0;33mлмп\033[Cм\033[1;43mА\033[0;33mм\033[1;37mп\033[0mм\033[2Cмл\033[1;30;47mАА\033[40mп\033[47mл\033[C\033[0;30;43mБА\033[33;40mм\033[32mп\033[1;30mм\033[7C\033[0;33m[\033[1mB\033[0;33m]\033[1muy\033[CArmour\n";
    $thismsg .= "\033[43mл\033[0;33mлллмп\033[1;37mмм\033[0mп\033[C\033[1;47mп\033[0mлмммм\033[1;30;47mАБ\033[40mм\033[0;33mпп\033[30;43mБА\033[1;40mл\033[7C\033[0;33m[\033[1mS\033[0;33m]\033[1mell\033[CArmour\n";
    $thismsg .= "\033[43mл\033[0;33mл\033[30;43mАБ\033[C\033[1;37;47mлВ\033[40mм\033[47mБА\033[0mммммлмп\033[1;30mммллм\033[0;33mп\033[1;30mл\033[7C\033[0;33m[\033[1mY\033[0;33m]\033[1mour\033[CStats\n";
    $thismsg .= "\033[43mВ\033[0;33mпмп\033[30;43mАп\033[1;37;40mпп\033[47mВБАА\033[0mллп\033[1;30mмАБВпп\033[0;33mмл\033[1;30mл\033[7C\033[0;33m[\033[1mR\033[0;33m]\033[1meturn\033[Cto\033[CTown\n";
    $thismsg .= "\033[43mБ\033[0;33mлмллп\033[32mм\033[1;42mА\033[0;32mм\033[C\033[33mмммммм\033[Cммл\033[30;43mА\033[33;40mлл\033[1;30mп\033[0;33mмў\033[C\033[1;30mмп\n";
    $thismsg .= "\033[33;43mА\033[0;33mлллллм\033[32mп\033[CВў\033[33mл\033[30;43mБА\033[33;40mпм\033[1;43mА\033[0;33mмпмппм\033[3C\033[1;30mБм\033[2C\033[33mмм\033[0;33mмм\033[1mм\033[0;33mмммммммммммммммммммммммммммммммммммммммммммм\n";
    $thismsg .= "\033[A\033[79C\033[1;30;43mА\033[33mА\033[0;33mллллллллмм\033[32mў\033[33mпллмпммпп\033[1;30mммл\033[2CмВм\033[C\033[33;43mБ\033[2C\033[0m                      \033[3C\033[33mм\n";
    $thismsg .= "ппп\033[1;30mп\033[0;33mпп\033[1;30mп\033[0;33mп\033[1;30mпп\033[0;33mп\033[1;30mппп\033[0;33mп\033[1;30mппппппппппппп\033[C\033[0;33mппппппппппппппппппппппппппппп\033[1;30mп\033[C\033[0;33mппппппппппппппппппп\n";
    $thismsg .= "\033[A\033[79Cп\033[0m\n";
    return $thismsg . "\n";
}

function art_arthur() {
    $thismsg .= "\033[34mм\033[1;44mА\033[0;34mмпА\033[CВАў\033[2Cмў\033[6CмВ\033[CмВ\033[C\033[1;44mБ\033[40mп\033[0;34mп\033[1mпп\033[0;34mп\033[1mп\033[0;34mпппп\033[1mп\033[0;34mппппппппппппппппппппппппппппппппппппппп\033[Cп\n";
    $thismsg .= "\033[Cп\033[2CАпп\033[1;37mмммм\033[0mм\033[1mпп\033[0mп\033[1mпп\033[0mп\033[1mпм\033[0mмммм\033[C\033[34mп\033[3C\033[1;37mSaga\033[Cof\033[Cthe\033[CRed\033[CDragon\033[C-\033[C\033[34mKing\033[CArthurs\033[CWeapons    \033[C\033[0;34mл\n";
    $thismsg .= "п\033[1;37mмппппп\033[C\033[0mмммммллл\033[30;47mп\033[37;40mлммммм\033[Cп\033[1;30mп\033[0mп\033[1;30mппм\033[4C\033[0;34mмммм\033[Cммммммммммм\033[CммммммммммммммммммммВмммм\033[Cмм\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[1mл\033[Cм\033[47mллпВБА\033[0mлп\033[1mм\033[0mплл\033[30;47mпА\033[37;40mллпмпллллллм\033[C\033[1;30;47mВ\033[C\033[0;34mА\033[3CВ\033[20Cп\033[17C\033[1mмммм\n";
    $thismsg .= "\033[A\033[79C\033[0m \033[1mл\033[C\033[47mллВ\033[0mл\033[30;47mА\033[37;40mллл\033[C\033[1mл\033[47mВ\033[40mм\033[0mпллпм\033[1;47mА\033[0mл\033[Cлл\033[1;47mАААА\033[30mА\033[C\033[40mл\033[3C\033[0;34mYou\033[Cwalk\033[Cinto\033[Cthe\033[Cwell\033[Cknown\033[Cweapons\033[6C\033[1mл\033[44mВ\033[0;34mл\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[1mл\033[C\033[47mВВВ \033[0;30;47mпБ\033[37;40mллл\033[C\033[1mл\033[C\033[47mВ\033[40mм\033[C\033[47mБА \033[C\033[0mл\033[1;47mААБББА\033[30mА\033[C\033[40mл\033[3C\033[0;34mshop,\033[Cyou\033[Cpause\033[Cto\033[Clook\033[Caround\033[Cat\033[Call\033[Cof\033[2Cо\033[1;44mБ\033[0;34mл\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[1mл\033[Cп\033[47mВБ\033[0mллллллл\033[C\033[1mл\033[C\033[47mВБ\033[0mмпм\033[1;47mААББААА\033[30mА\033[0mп\033[C\033[1;30mл\033[3C\033[0;34mthe\033[Cmany\033[Cimplements\033[Cof\033[Cdestruction.\033[2CA\033[37m \033[4C\033[1;34;44mА\033[0;34mл\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[C \033[1mл\033[C\033[47mБА\033[0mллллллп\033[1mм\033[C\033[47mВ\033[40mмп\033[47mБА\033[0mмп\033[1;47mБАА\033[0mл\033[30;47mмА\033[1mБ\033[C\033[40mВ\033[4C\033[0;34mfat\033[Cman\033[Cwoddles\033[Cinto\033[Cthe\033[Croom,\033[Cand\033[2C  \033[37m   \033[2C\033[1;34;44mА\033[0;30;44mА\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[C \033[1mл\033[C\033[47mА \033[0mллп\033[33mм\033[37mп\033[1mм\033[47mВВБ\033[0mм\033[1mп\033[47mБА\033[0;30;47mАп\033[1mА\033[0mмп\033[33mм\033[37mплл\033[1;30;47mВ\033[C\033[40mВ\033[4C\033[0;34masks\033[C\"\033[1mWadaya\033[Cwant\033[Ckid?\033[0;34m\"\033[17C\033[37m \033[2C\033[1;34;44mА\033[0;30;44mА\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[C \033[1mл\033[C\033[47mА\033[0mл\033[30;47mўА\033[37;40mп\033[1;33mм\033[43mБ\033[0;33mм\033[1;37mп\033[47mБА\033[0mпммпп\033[1;47m \033[0mп\033[33mм\033[1;43mБ\033[C\033[0mлл\033[1;30mлп\033[CВ\033[47C\033[0;34mл\033[30;44mБ\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[34mА\033[C \033[1;37;47mВ\033[CА\033[0mп\033[1;33mм\033[43mВ\033[40mп\033[C\033[43mА\033[0;33mпм\033[C\033[1;37;47mББА\033[0mлп\033[1;33mм\033[43mВ\033[C\033[0;33mп\033[1;43mА\033[0;33mм\033[37mп\033[1;30mл\033[CВ\033[6C\033[0;34m[\033[1mB\033[0;34m]\033[1muy\033[CWeapon\033[30C\033[0;34mл\033[30;44mБ\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[34mВ\033[C \033[1;37;47mБ\033[2C\033[40mп\033[33mлм\033[0;33mВп\033[37mмлм\033[1;47mБАА\033[0mлм\033[1mп\033[0mмм\033[1;33mпмм\033[43mБ\033[0;33mп\033[2C\033[1;30mл\033[6C\033[0;34m[\033[1mS\033[0;34m]\033[1mell\033[CWeapon\033[29C\033[0;34mл\033[30;44mБ\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[34mАА\033[C \033[1;37;47mА\033[C\033[0mпмммл\033[1;47mАААА\033[0;30;47mА\033[37;40mлллл\033[1;30;47mА\033[0mллмм\033[1;30mмп\033[Cл\033[7C\033[0;34m[\033[1mY\033[0;34m]\033[1mour\033[CStats\033[30C\033[0;34mл\033[30;44mВ\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[C\033[34mА\033[C   \033[37mпм\033[Cппллллл\033[30;47mмБ\033[37;40mллл\033[1;30;47mммВ\033[40mпп\033[Cмп\033[0;34mА\033[7C[\033[1mR\033[0;34m]\033[1meturn\033[Cto\033[CTown\033[25C\033[0;34mо\033[1;44mБ\033[0;30;44mВ\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[34mм\033[1;44mА\033[0;34mм\033[CВм\033[37mппмм\033[Cппп\033[1;30;47mАБл\033[40mппп\033[Cммпп\033[C\033[0;34mмлА\033[47Cл\033[1;44mА\033[0;30;44mВ\033[40m\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[C\033[34mп\033[CмўВллмм\033[37mпппм\033[C\033[1;30mп\033[Cмппп\033[C\033[0;34mААпВВА\033[2C\033[1;44mА\033[0;34mпппВпп\033[CпВп\033[Cпп\033[CпА\033[Cп\033[Cпп\033[Cпп\033[30;44mБ\033[19C\033[34;40mпппп\n";
    $thismsg .= "\033[A\033[79C\033[37m \033[34mБВлм\033[CАпВВВВпА\033[C\033[37mп\033[1;30mмп\033[C\033[0;34mпВА\033[4CА\033[Cмл\033[30;44mА \033[34;40mў\033[37m                      \033[34mм\033[30;44mАВ\033[34;40mллл\033[30;44mА\033[34;40mлмлллллолл\n";
    return $thismsg . "\n";
}

function art_armbuy() {
    $thismsg .= "\033[12C\033[1;33mммммммммммммммммммммммммммммм\033[0;33mм\033[1mммм\033[0;33mм\033[1mм\033[0;33mмм\033[1mм\033[0;33mм\033[1mммммммммммм\n";
    $thismsg .= "\033[12C\033[47mВ\033[40mп\033[2C\033[37m The\033[CSaga\033[Cof\033[Cthe\033[CRed\033[CDragon\033[C-\033[C\033[33mArmour\033[CList \033[2Cм\033[47mВ\033[40m\n";
    $thismsg .= "\033[12C\033[47mВл\033[40mппппппп\033[0;33mп\033[1mпппп\033[0;33mп\033[1mппп\033[0;33mп\033[1mпп\033[0;33mп\033[1mп\033[0;33mпп\033[1mп\033[0;33mп\033[1mппппппппппппппппппппп\033[47mВВ\033[40m\n";
    $thismsg .= "\033[12C\033[43mл\033[4C\033[40mArmour\033[25CPrice\033[8Cл\n";
    $thismsg .= "\033[12C\033[43mл\033[2C\033[0;33m1.\033[CCoat\033[1;30m...................................\033[33m200\033[Cл\n";
    $thismsg .= "\033[12C\033[43mл\033[2C\033[0;33m2.\033[CHeavy\033[CCoat\033[1;30m...........................\033[33m1,000\033[Cл\n";
    $thismsg .= "\033[12C\033[43mл\033[2C\033[0;33m3.\033[CLeather\033[CVest\033[1;30m.........................\033[33m3,000\033[C\033[43mВ\033[40m\n";
    $thismsg .= "\033[12C\033[43mВ\033[2C\033[0;33m4.\033[CBronze\033[CArmour\033[1;30m.......................\033[33m10,000\033[C\033[43mБ\033[40m\n";
    $thismsg .= "\033[12C\033[43mБ\033[2C\033[0;33m5.\033[CIron\033[CArmour\033[1;30m.........................\033[33m30,000\033[C\033[43mА\033[40m\n";
    $thismsg .= "\033[12C\033[0;33mп\033[2C6.\033[CGraphite\033[CArmour\033[1;30m....................\033[33m100,000\033[C\033[0;33mп\n";
    $thismsg .= "\033[12CА\033[2C7.\033[CErdrick's\033[CArmour\033[1;30m...................\033[33m150,000\033[C\033[0;33mА\n";
    $thismsg .= "\033[12CБ\033[2C8.\033[CArmour\033[Cof\033[CDeath\033[1;30m....................\033[33m200,000\033[C\033[0;33mБ\n";
    $thismsg .= "\033[12CВ\033[2C9.\033[CAble's\033[CArmour\033[1;30m......................\033[33m400,000\033[C\033[0;33mВ\n";
    $thismsg .= "\033[12Cл\033[C10.\033[CFull\033[CBody\033[CArmour\033[1;30m.................\033[33m1,000,000\033[C\033[0;33mл\n";
    $thismsg .= "\033[12Cп\033[C11.\033[CBlood\033[CArmour\033[1;30m.....................\033[33m4,000,000\033[C\033[0;33mл\n";
    $thismsg .= "\033[12Cл\033[C12.\033[CMagic\033[CProtection\033[1;30m................\033[33m10,000,000\033[C\033[0;33mм\n";
    $thismsg .= "\033[12Cл\033[C13.\033[CBelar's\033[CMail\033[1;30m....................\033[33m40,000,000\033[C\033[0;33mл\n";
    $thismsg .= "\033[12Cл\033[C14.\033[CGolden\033[CArmour\033[1;30m..................\033[33m100,000,000\033[C\033[0;33mл\n";
    $thismsg .= "\033[12Cл\033[C15.\033[CArmour\033[COf\033[CLore\033[1;30m.................\033[33m400,000,000\033[C\033[43mА\033[40m\n";
    $thismsg .= "\033[12C\033[43mА\033[0;33mлммммммВмммАммВм\033[CммммВммм\033[CммнммммВммА\033[CммммВммммл\033[1;43mА\033[40m\033[0m\n";
    return $thismsg . "\n";
}

function art_wepbuy() {
    $thismsg .= "\033[14C\033[1;34mммммммммммммммммммммммммммммм\033[0;34mм\033[1mмммм\033[0;34mм\033[1mм\033[0;34mмм\033[1mм\033[0;34mм\033[1mмммммммммм\n";
    $thismsg .= "\033[14C\033[46mВ\033[40mп\033[2C\033[37m The\033[CSaga\033[Cof\033[Cthe\033[CRed\033[CDragon\033[C-\033[C\033[34mWeapons\033[CList \033[Cм\033[46mВ\033[40m\n";
    $thismsg .= "\033[14C\033[46mВ\033[44mл\033[40mпппп\033[0;34mп\033[1mппп\033[0;34mп\033[1mпп\033[0;34mп\033[1mп\033[0;34mпп\033[1mп\033[0;34mп\033[1mппппппппппппппппппппппппппппп\033[46mВВ\033[40m\n";
    $thismsg .= "\033[14C\033[46mл\033[2C\033[0;36mWeapons\033[27CPrice\033[7C\033[1;34;44mл\033[40m\n";
    $thismsg .= "\033[14C\033[44mл\033[2C\033[40m1.\033[CStick\033[0;34m..................................\033[36m200\033[C\033[1;34;44mл\033[40m\n";
    $thismsg .= "\033[14C\033[44mл\033[2C\033[40m2.\033[CDagger\033[0;34m...............................\033[36m1,000\033[C\033[1;34;44mл\033[40m\n";
    $thismsg .= "\033[14C\033[44mВ\033[2C\033[40m3.\033[CShort\033[CSword\033[0;34m..........................\033[36m3,000\033[C\033[1;34;44mВ\033[40m\n";
    $thismsg .= "\033[14C\033[44mБ\033[2C\033[40m4.\033[CLong\033[CSword\033[0;34m..........................\033[36m10,000\033[C\033[1;34;44mБ\033[40m\n";
    $thismsg .= "\033[14C\033[44mА\033[2C\033[40m5.\033[CHuge\033[CAxe\033[0;34m............................\033[36m30,000\033[C\033[1;34;44mА\033[40m\n";
    $thismsg .= "\033[14C\033[0;34mп\033[2C\033[1m6.\033[CBone\033[CCruncher\033[0;34m......................\033[36m100,000\033[C\033[34mп\n";
    $thismsg .= "\033[14CА\033[2C\033[1m7.\033[CTwin\033[CSwords\033[0;34m........................\033[36m150,000\033[C\033[34mА\n";
    $thismsg .= "\033[14CБ\033[2C\033[1m8.\033[CPower\033[CAxe\033[0;34m..........................\033[36m200,000\033[C\033[34mБ\n";
    $thismsg .= "\033[14CВ\033[2C\033[1m9.\033[CAble's\033[CSword\033[0;34m.......................\033[36m400,000\033[C\033[34mВ\n";
    $thismsg .= "\033[14Cл\033[C\033[1m10.\033[CWan's\033[CWeapon\033[0;34m.....................\033[36m1,000,000\033[C\033[34mл\n";
    $thismsg .= "\033[14Cп\033[C\033[1m11.\033[CSpear\033[COf\033[CGold\033[0;34m....................\033[36m4,000,000\033[C\033[34mл\n";
    $thismsg .= "\033[14Cл\033[C\033[1m12.\033[CCrystal\033[CShard\033[0;34m...................\033[36m10,000,000\033[C\033[34mм\n";
    $thismsg .= "\033[14Cл\033[C\033[1m13.\033[CNiras's\033[CTeeth\033[0;34m...................\033[36m40,000,000\033[C\033[34mл\n";
    $thismsg .= "\033[14Cл\033[C\033[1m14.\033[CBlood\033[CSword\033[0;34m....................\033[36m100,000,000\033[C\033[34mл\n";
    $thismsg .= "\033[14Cл\033[C\033[1m15.\033[CDeath\033[CSword\033[0;34m....................\033[36m400,000,000\033[C\033[1;34;44mА\033[40m\n";
    $thismsg .= "\033[14C\033[44mА\033[0;34mлмммммВ\033[CмммммммммммммВ\033[Cммм\033[Cмм\033[CмА\033[Cм\033[CммммВммммАммл\033[1;44mА\033[40m\n";
    $thismsg .= "\033[0m\n";
    return $thismsg . "\n";
}

function art_forest() {
    $thismsg .= "\033[C\033[30mм\033[Cмм\033[Cммм\033[CммммммВммммммммммВмммммммммммммммм\033[C\033[37mмм\033[C\033[30mмм\033[C\033[32mм\033[2Cм\033[1;42mБ\033[0;32mп\033[Cл\033[30;42mА\033[32;40mм\033[C\033[1;30mммм\n";
    $thismsg .= "\033[2C\033[0;30;47mл\033[37;40mммВмммммммммммммммммммммммммммм\033[30;47mппппппп\033[37;40mмм\033[C\033[1;47mо\033[40mл\033[47mВ\033[40mВ\033[2C\033[32;42mБ\033[0;32mпл\033[C\033[1;42mА\033[0;32mмл\033[1;42mА\033[0;32mлп\033[30;42mБ\033[C\033[37;40mм\033[C\033[1;30mпВ\n";
    $thismsg .= "\033[2C\033[0;30;47mВБА\033[37;40mл\033[1;47m  Saga of the Red Dragon\033[0mл\033[30;47m- Forest   АБ\033[37;40mм\033[1mп\033[0mпм\033[C\033[1;32;42mА\033[0;32mпм\033[30;42mАБ\033[32;40mў\033[33mо\033[32mп\033[33mмп\033[32mп\033[37mмллВ\n";
    $thismsg .= "\033[CА\033[C\033[30;47mВБА\033[37;40mлл\033[30;47m   \033[37;40mп\033[30;47mА       \033[37;40mВ\033[30;47mмммм\033[37;40mппппп\033[30;47mмммммммммммммм\033[37;40mп\033[30;47mм\033[C\033[32;40mўппппп\033[1;30mпп\033[C\033[0;30;43mА\033[33;40mо\033[C\033[37mБВллВ\033[C\033[1;30mВ\n";
    $thismsg .= "\033[4C\033[0;30;47mВБА\033[37;40mлллм\033[Cм\033[30;47mБ\033[37;40mлл\033[30;47mпА\033[37;40mлпп\033[30;47mл\033[42mА                     Б\033[47mл\033[37;40mл\033[30;47mА\033[37;40mп\033[30;47mБ\033[C\033[1;33;43m \033[30;40mн\033[0mоВ\033[C\033[30;43mАБ\033[C\033[37;40mВп\033[32mмм\033[37mп\033[C\033[1;30mл\n";
    $thismsg .= "\033[4Cм\033[2Cм\033[Cмм\033[Cммм\033[Cмммм\033[47mп\033[40mммммммммммммммммммммммммм\033[CмВ\033[C\033[0;33mм\033[1;43mА\033[30mо\033[C\033[0;33mм\033[30;43mА\033[1;40mм\033[0;33mпнм\033[32mп\033[1;42mА\033[0;32mпп\033[1;30mм\033[47mВ\033[40m\n";
    $thismsg .= "\033[34Cп\n";
    $thismsg .= "\033[2C\033[0;32mThe murky forest stands before you - a giant maw of gloomy darkness\n";
    $thismsg .= "\033[2Cever beckoning.\033[37m              \n\n";
    $thismsg .= func_normmenu("(L)ook for something to kill");
    $thismsg .= func_normmenu("(H)ealer's Hut");
    $thismsg .= func_normmenu("(R)eturn to town");
    return $thismsg . "\n";
}
